Autodesk.Revit.DB.Frame.IsRightHanded
Determine if this frame's basis is right-handed.
Remarks:
The three basis vectors are "right-handed" if the triple vector product [vecX, vecY, vecZ]
is positive, or equivalently if dot(vecX x vecY, vecZ) is positive, where "dot" represents the dot product.
Returns:
True if this frame's basis is right-handed, false if not.
Since:
2012

Autodesk.Revit.DB.Frame.IsOrthonormal
Determines if this frame's basis vectors are orthonormal.
Remarks:
"Orthonormal" means that the three vectors are orthogonal and each of them has unit length.
Returns:
True if this frame's basis vectors are orthonormal, false if not.
Since:
2012

Autodesk.Revit.DB.Frame.IsOrthogonal
Determines if this frame's basis vectors are orthogonal.
Returns:
True if this frame's basis vectors are orthogonal, false if not.
Since:
2012

Autodesk.Revit.DB.Frame.Transform(Autodesk.Revit.DB.Transform)
Applies the input transform to this frame.
trf:
The transform to apply to the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2012

Autodesk.Revit.DB.Frame.CanDefineRevitGeometry(Autodesk.Revit.DB.Frame)
Tests whether the supplied Frame object may be used to define a Revit curve or surface.
In order to satisfy the requirements the Frame must be orthonormal
and its origin is expected to lie within the Revit design limits Autodesk.Revit.DB.XYZ.IsWithinLengthLimits(Autodesk.Revit.DB.XYZ).
Remarks:
Certain Revit curve and surface types are defined using a local frame of reference.
frameOfReference:
Frame to be validated.
Returns:
True if this Frame may be used as a local frame of reference, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Frame.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Frame.BasisZ
The third basis vector of the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Frame.BasisY
The second basis vector of the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Frame.BasisX
The first basis vector of the frame.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Frame.Origin
The frame's base point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Frame.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructor that takes the frame's base point and three basis vectors.
origin:
The frame's base point.
vec1:
The frame's first basis vector.
vec2:
The frame's second basis vector.
vec3:
The frame's third basis vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Frame.#ctor
Default constructor. Uses global origin and standard basis vectors.
Since:
2012

Autodesk.Revit.DB.Frame
A Frame comprises three vectors at a base point in 3D space.
Remarks:
A Frame consists of three vectors at a base point in 3D space.
The vectors need not be orthogonal, have unit length, or even be linearly
independent, although in practice Frames will usually have linearly
independent vectors.
Frames may be used to represent a coordinate frame of reference,
a moving frame field on a curve, or for other purposes.
Since:
2012